ZigEmbeddedGroup/microzig/port/espressif/esp/src/chips/ESP32-C3.svd
        <register>
          <name>LSCH4_DUTY</name>
          <description>LEDC_LSCH4_DUTY.</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DUTY_LSCH4</name>
              <description>reg_duty_lsch4.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LSCH4_CONF1</name>
          <description>LEDC_LSCH4_CONF1.</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <resetValue>0x40000000</resetValue>
          <fields>
            <field>
              <name>DUTY_SCALE_LSCH4</name>
              <description>reg_duty_scale_lsch4.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_CYCLE_LSCH4</name>
              <description>reg_duty_cycle_lsch4.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_NUM_LSCH4</name>
              <description>reg_duty_num_lsch4.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_INC_LSCH4</name>
              <description>reg_duty_inc_lsch4.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_START_LSCH4</name>
              <description>reg_duty_start_lsch4.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LSCH4_DUTY_R</name>
          <description>LEDC_LSCH4_DUTY_R.</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DUTY_LSCH4_R</name>
              <description>reg_duty_lsch4_r.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LSCH5_CONF0</name>
          <description>LEDC_LSCH5_CONF0.</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TIMER_SEL_LSCH5</name>
              <description>reg_timer_sel_lsch5.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG_OUT_EN_LSCH5</name>
              <description>reg_sig_out_en_lsch5.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDLE_LV_LSCH5</name>
              <description>reg_idle_lv_lsch5.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARA_UP_LSCH5</name>
              <description>reg_para_up_lsch5.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OVF_NUM_LSCH5</name>
              <description>reg_ovf_num_lsch5.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVF_CNT_EN_LSCH5</name>
              <description>reg_ovf_cnt_en_lsch5.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVF_CNT_RESET_LSCH5</name>
              <description>reg_ovf_cnt_reset_lsch5.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LSCH5_HPOINT</name>
          <description>LEDC_LSCH5_HPOINT.</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HPOINT_LSCH5</name>
              <description>reg_hpoint_lsch5.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LSCH5_DUTY</name>
          <description>LEDC_LSCH5_DUTY.</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DUTY_LSCH5</name>
              <description>reg_duty_lsch5.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LSCH5_CONF1</name>
          <description>LEDC_LSCH5_CONF1.</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <resetValue>0x40000000</resetValue>
          <fields>
            <field>
              <name>DUTY_SCALE_LSCH5</name>
              <description>reg_duty_scale_lsch5.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_CYCLE_LSCH5</name>
              <description>reg_duty_cycle_lsch5.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_NUM_LSCH5</name>
              <description>reg_duty_num_lsch5.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_INC_LSCH5</name>
              <description>reg_duty_inc_lsch5.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_START_LSCH5</name>
              <description>reg_duty_start_lsch5.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LSCH5_DUTY_R</name>
          <description>LEDC_LSCH5_DUTY_R.</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DUTY_LSCH5_R</name>
              <description>reg_duty_lsch5_r.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LSTIMER0_CONF</name>
          <description>LEDC_LSTIMER0_CONF.</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00800000</resetValue>
          <fields>
            <field>
              <name>LSTIMER0_DUTY_RES</name>
              <description>reg_lstimer0_duty_res.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_DIV_LSTIMER0</name>
              <description>reg_clk_div_lstimer0.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSTIMER0_PAUSE</name>
              <description>reg_lstimer0_pause.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSTIMER0_RST</name>
              <description>reg_lstimer0_rst.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TICK_SEL_LSTIMER0</name>
              <description>reg_tick_sel_lstimer0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSTIMER0_PARA_UP</name>
              <description>reg_lstimer0_para_up.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LSTIMER0_VALUE</name>
          <description>LEDC_LSTIMER0_VALUE.</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LSTIMER0_CNT</name>
              <description>reg_lstimer0_cnt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LSTIMER1_CONF</name>
          <description>LEDC_LSTIMER1_CONF.</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00800000</resetValue>
          <fields>
            <field>
              <name>LSTIMER1_DUTY_RES</name>
              <description>reg_lstimer1_duty_res.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_DIV_LSTIMER1</name>
              <description>reg_clk_div_lstimer1.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSTIMER1_PAUSE</name>
              <description>reg_lstimer1_pause.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSTIMER1_RST</name>
              <description>reg_lstimer1_rst.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TICK_SEL_LSTIMER1</name>
              <description>reg_tick_sel_lstimer1.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSTIMER1_PARA_UP</name>
              <description>reg_lstimer1_para_up.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LSTIMER1_VALUE</name>
          <description>LEDC_LSTIMER1_VALUE.</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LSTIMER1_CNT</name>
              <description>reg_lstimer1_cnt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LSTIMER2_CONF</name>
          <description>LEDC_LSTIMER2_CONF.</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00800000</resetValue>
          <fields>
            <field>
              <name>LSTIMER2_DUTY_RES</name>
              <description>reg_lstimer2_duty_res.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_DIV_LSTIMER2</name>
              <description>reg_clk_div_lstimer2.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSTIMER2_PAUSE</name>
              <description>reg_lstimer2_pause.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSTIMER2_RST</name>
              <description>reg_lstimer2_rst.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TICK_SEL_LSTIMER2</name>
              <description>reg_tick_sel_lstimer2.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSTIMER2_PARA_UP</name>
              <description>reg_lstimer2_para_up.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LSTIMER2_VALUE</name>
          <description>LEDC_LSTIMER2_VALUE.</description>
          <addressOffset>0xB4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LSTIMER2_CNT</name>
              <description>reg_lstimer2_cnt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LSTIMER3_CONF</name>
          <description>LEDC_LSTIMER3_CONF.</description>
          <addressOffset>0xB8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00800000</resetValue>
          <fields>
            <field>
              <name>LSTIMER3_DUTY_RES</name>
              <description>reg_lstimer3_duty_res.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_DIV_LSTIMER3</name>
              <description>reg_clk_div_lstimer3.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSTIMER3_PAUSE</name>
              <description>reg_lstimer3_pause.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSTIMER3_RST</name>
              <description>reg_lstimer3_rst.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TICK_SEL_LSTIMER3</name>
              <description>reg_tick_sel_lstimer3.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSTIMER3_PARA_UP</name>
              <description>reg_lstimer3_para_up.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LSTIMER3_VALUE</name>
          <description>LEDC_LSTIMER3_VALUE.</description>
          <addressOffset>0xBC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LSTIMER3_CNT</name>
              <description>reg_lstimer3_cnt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>LEDC_INT_RAW.</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LSTIMER0_OVF_INT_RAW</name>
              <description>reg_lstimer0_ovf_int_raw.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LSTIMER1_OVF_INT_RAW</name>
              <description>reg_lstimer1_ovf_int_raw.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LSTIMER2_OVF_INT_RAW</name>
              <description>reg_lstimer2_ovf_int_raw.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LSTIMER3_OVF_INT_RAW</name>
              <description>reg_lstimer3_ovf_int_raw.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH0_INT_RAW</name>
              <description>reg_duty_chng_end_lsch0_int_raw.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH1_INT_RAW</name>
              <description>reg_duty_chng_end_lsch1_int_raw.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH2_INT_RAW</name>
              <description>reg_duty_chng_end_lsch2_int_raw.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH3_INT_RAW</name>
              <description>reg_duty_chng_end_lsch3_int_raw.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH4_INT_RAW</name>
              <description>reg_duty_chng_end_lsch4_int_raw.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH5_INT_RAW</name>
              <description>reg_duty_chng_end_lsch5_int_raw.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH0_INT_RAW</name>
              <description>reg_ovf_cnt_lsch0_int_raw.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH1_INT_RAW</name>
              <description>reg_ovf_cnt_lsch1_int_raw.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH2_INT_RAW</name>
              <description>reg_ovf_cnt_lsch2_int_raw.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH3_INT_RAW</name>
              <description>reg_ovf_cnt_lsch3_int_raw.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH4_INT_RAW</name>
              <description>reg_ovf_cnt_lsch4_int_raw.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH5_INT_RAW</name>
              <description>reg_ovf_cnt_lsch5_int_raw.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
