ZigEmbeddedGroup/microzig/port/espressif/esp/src/chips/ESP32-C3.svd
        <register>
          <name>INT_ST</name>
          <description>LEDC_INT_ST.</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LSTIMER0_OVF_INT_ST</name>
              <description>reg_lstimer0_ovf_int_st.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LSTIMER1_OVF_INT_ST</name>
              <description>reg_lstimer1_ovf_int_st.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LSTIMER2_OVF_INT_ST</name>
              <description>reg_lstimer2_ovf_int_st.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LSTIMER3_OVF_INT_ST</name>
              <description>reg_lstimer3_ovf_int_st.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH0_INT_ST</name>
              <description>reg_duty_chng_end_lsch0_int_st.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH1_INT_ST</name>
              <description>reg_duty_chng_end_lsch1_int_st.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH2_INT_ST</name>
              <description>reg_duty_chng_end_lsch2_int_st.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH3_INT_ST</name>
              <description>reg_duty_chng_end_lsch3_int_st.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH4_INT_ST</name>
              <description>reg_duty_chng_end_lsch4_int_st.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH5_INT_ST</name>
              <description>reg_duty_chng_end_lsch5_int_st.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH0_INT_ST</name>
              <description>reg_ovf_cnt_lsch0_int_st.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH1_INT_ST</name>
              <description>reg_ovf_cnt_lsch1_int_st.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH2_INT_ST</name>
              <description>reg_ovf_cnt_lsch2_int_st.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH3_INT_ST</name>
              <description>reg_ovf_cnt_lsch3_int_st.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH4_INT_ST</name>
              <description>reg_ovf_cnt_lsch4_int_st.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH5_INT_ST</name>
              <description>reg_ovf_cnt_lsch5_int_st.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>LEDC_INT_ENA.</description>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LSTIMER0_OVF_INT_ENA</name>
              <description>reg_lstimer0_ovf_int_ena.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSTIMER1_OVF_INT_ENA</name>
              <description>reg_lstimer1_ovf_int_ena.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSTIMER2_OVF_INT_ENA</name>
              <description>reg_lstimer2_ovf_int_ena.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSTIMER3_OVF_INT_ENA</name>
              <description>reg_lstimer3_ovf_int_ena.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH0_INT_ENA</name>
              <description>reg_duty_chng_end_lsch0_int_ena.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH1_INT_ENA</name>
              <description>reg_duty_chng_end_lsch1_int_ena.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH2_INT_ENA</name>
              <description>reg_duty_chng_end_lsch2_int_ena.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH3_INT_ENA</name>
              <description>reg_duty_chng_end_lsch3_int_ena.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH4_INT_ENA</name>
              <description>reg_duty_chng_end_lsch4_int_ena.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH5_INT_ENA</name>
              <description>reg_duty_chng_end_lsch5_int_ena.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH0_INT_ENA</name>
              <description>reg_ovf_cnt_lsch0_int_ena.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH1_INT_ENA</name>
              <description>reg_ovf_cnt_lsch1_int_ena.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH2_INT_ENA</name>
              <description>reg_ovf_cnt_lsch2_int_ena.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH3_INT_ENA</name>
              <description>reg_ovf_cnt_lsch3_int_ena.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH4_INT_ENA</name>
              <description>reg_ovf_cnt_lsch4_int_ena.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH5_INT_ENA</name>
              <description>reg_ovf_cnt_lsch5_int_ena.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>LEDC_INT_CLR.</description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LSTIMER0_OVF_INT_CLR</name>
              <description>reg_lstimer0_ovf_int_clr.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LSTIMER1_OVF_INT_CLR</name>
              <description>reg_lstimer1_ovf_int_clr.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LSTIMER2_OVF_INT_CLR</name>
              <description>reg_lstimer2_ovf_int_clr.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LSTIMER3_OVF_INT_CLR</name>
              <description>reg_lstimer3_ovf_int_clr.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH0_INT_CLR</name>
              <description>reg_duty_chng_end_lsch0_int_clr.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH1_INT_CLR</name>
              <description>reg_duty_chng_end_lsch1_int_clr.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH2_INT_CLR</name>
              <description>reg_duty_chng_end_lsch2_int_clr.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH3_INT_CLR</name>
              <description>reg_duty_chng_end_lsch3_int_clr.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH4_INT_CLR</name>
              <description>reg_duty_chng_end_lsch4_int_clr.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH5_INT_CLR</name>
              <description>reg_duty_chng_end_lsch5_int_clr.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH0_INT_CLR</name>
              <description>reg_ovf_cnt_lsch0_int_clr.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH1_INT_CLR</name>
              <description>reg_ovf_cnt_lsch1_int_clr.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH2_INT_CLR</name>
              <description>reg_ovf_cnt_lsch2_int_clr.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH3_INT_CLR</name>
              <description>reg_ovf_cnt_lsch3_int_clr.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH4_INT_CLR</name>
              <description>reg_ovf_cnt_lsch4_int_clr.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH5_INT_CLR</name>
              <description>reg_ovf_cnt_lsch5_int_clr.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF</name>
          <description>LEDC_CONF.</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB_CLK_SEL</name>
              <description>reg_apb_clk_sel.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>reg_clk_en.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>LEDC_DATE.</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <resetValue>0x19061700</resetValue>
          <fields>
            <field>
              <name>LEDC_DATE</name>
              <description>reg_ledc_date.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
