ZigEmbeddedGroup/microzig/port/espressif/esp/src/chips/ESP32-C3.svd
        <register>
          <name>DMA_APBPERI_BACKUP_PMS_CONSTRAIN_0</name>
          <description>SENSITIVE_DMA_APBPERI_BACKUP_PMS_CONSTRAIN_0_REG</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_APBPERI_BACKUP_PMS_CONSTRAIN_LOCK</name>
              <description>dma_apbperi_backup_pms_constrain_lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_BACKUP_PMS_CONSTRAIN_1</name>
          <description>SENSITIVE_DMA_APBPERI_BACKUP_PMS_CONSTRAIN_1_REG</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <resetValue>0x000FF0FF</resetValue>
          <fields>
            <field>
              <name>DMA_APBPERI_BACKUP_PMS_CONSTRAIN_SRAM_WORLD_0_PMS_0</name>
              <description>dma_apbperi_backup_pms_constrain_sram_world_0_pms_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_BACKUP_PMS_CONSTRAIN_SRAM_WORLD_0_PMS_1</name>
              <description>dma_apbperi_backup_pms_constrain_sram_world_0_pms_1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_BACKUP_PMS_CONSTRAIN_SRAM_WORLD_0_PMS_2</name>
              <description>dma_apbperi_backup_pms_constrain_sram_world_0_pms_2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_BACKUP_PMS_CONSTRAIN_SRAM_WORLD_0_PMS_3</name>
              <description>dma_apbperi_backup_pms_constrain_sram_world_0_pms_3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_BACKUP_PMS_CONSTRAIN_SRAM_WORLD_1_PMS_0</name>
              <description>dma_apbperi_backup_pms_constrain_sram_world_1_pms_0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_BACKUP_PMS_CONSTRAIN_SRAM_WORLD_1_PMS_1</name>
              <description>dma_apbperi_backup_pms_constrain_sram_world_1_pms_1</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_BACKUP_PMS_CONSTRAIN_SRAM_WORLD_1_PMS_2</name>
              <description>dma_apbperi_backup_pms_constrain_sram_world_1_pms_2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_BACKUP_PMS_CONSTRAIN_SRAM_WORLD_1_PMS_3</name>
              <description>dma_apbperi_backup_pms_constrain_sram_world_1_pms_3</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_LC_PMS_CONSTRAIN_0</name>
          <description>SENSITIVE_DMA_APBPERI_LC_PMS_CONSTRAIN_0_REG</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_APBPERI_LC_PMS_CONSTRAIN_LOCK</name>
              <description>dma_apbperi_lc_pms_constrain_lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_LC_PMS_CONSTRAIN_1</name>
          <description>SENSITIVE_DMA_APBPERI_LC_PMS_CONSTRAIN_1_REG</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <resetValue>0x000FF0FF</resetValue>
          <fields>
            <field>
              <name>DMA_APBPERI_LC_PMS_CONSTRAIN_SRAM_WORLD_0_PMS_0</name>
              <description>dma_apbperi_lc_pms_constrain_sram_world_0_pms_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_LC_PMS_CONSTRAIN_SRAM_WORLD_0_PMS_1</name>
              <description>dma_apbperi_lc_pms_constrain_sram_world_0_pms_1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_LC_PMS_CONSTRAIN_SRAM_WORLD_0_PMS_2</name>
              <description>dma_apbperi_lc_pms_constrain_sram_world_0_pms_2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_LC_PMS_CONSTRAIN_SRAM_WORLD_0_PMS_3</name>
              <description>dma_apbperi_lc_pms_constrain_sram_world_0_pms_3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_LC_PMS_CONSTRAIN_SRAM_WORLD_1_PMS_0</name>
              <description>dma_apbperi_lc_pms_constrain_sram_world_1_pms_0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_LC_PMS_CONSTRAIN_SRAM_WORLD_1_PMS_1</name>
              <description>dma_apbperi_lc_pms_constrain_sram_world_1_pms_1</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_LC_PMS_CONSTRAIN_SRAM_WORLD_1_PMS_2</name>
              <description>dma_apbperi_lc_pms_constrain_sram_world_1_pms_2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_LC_PMS_CONSTRAIN_SRAM_WORLD_1_PMS_3</name>
              <description>dma_apbperi_lc_pms_constrain_sram_world_1_pms_3</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_AES_PMS_CONSTRAIN_0</name>
          <description>SENSITIVE_DMA_APBPERI_AES_PMS_CONSTRAIN_0_REG</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_APBPERI_AES_PMS_CONSTRAIN_LOCK</name>
              <description>dma_apbperi_aes_pms_constrain_lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_AES_PMS_CONSTRAIN_1</name>
          <description>SENSITIVE_DMA_APBPERI_AES_PMS_CONSTRAIN_1_REG</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <resetValue>0x000FF0FF</resetValue>
          <fields>
            <field>
              <name>DMA_APBPERI_AES_PMS_CONSTRAIN_SRAM_WORLD_0_PMS_0</name>
              <description>dma_apbperi_aes_pms_constrain_sram_world_0_pms_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_AES_PMS_CONSTRAIN_SRAM_WORLD_0_PMS_1</name>
              <description>dma_apbperi_aes_pms_constrain_sram_world_0_pms_1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_AES_PMS_CONSTRAIN_SRAM_WORLD_0_PMS_2</name>
              <description>dma_apbperi_aes_pms_constrain_sram_world_0_pms_2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_AES_PMS_CONSTRAIN_SRAM_WORLD_0_PMS_3</name>
              <description>dma_apbperi_aes_pms_constrain_sram_world_0_pms_3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_AES_PMS_CONSTRAIN_SRAM_WORLD_1_PMS_0</name>
              <description>dma_apbperi_aes_pms_constrain_sram_world_1_pms_0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_AES_PMS_CONSTRAIN_SRAM_WORLD_1_PMS_1</name>
              <description>dma_apbperi_aes_pms_constrain_sram_world_1_pms_1</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_AES_PMS_CONSTRAIN_SRAM_WORLD_1_PMS_2</name>
              <description>dma_apbperi_aes_pms_constrain_sram_world_1_pms_2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_AES_PMS_CONSTRAIN_SRAM_WORLD_1_PMS_3</name>
              <description>dma_apbperi_aes_pms_constrain_sram_world_1_pms_3</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_SHA_PMS_CONSTRAIN_0</name>
          <description>SENSITIVE_DMA_APBPERI_SHA_PMS_CONSTRAIN_0_REG</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_APBPERI_SHA_PMS_CONSTRAIN_LOCK</name>
              <description>dma_apbperi_sha_pms_constrain_lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_SHA_PMS_CONSTRAIN_1</name>
          <description>SENSITIVE_DMA_APBPERI_SHA_PMS_CONSTRAIN_1_REG</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <resetValue>0x000FF0FF</resetValue>
          <fields>
            <field>
              <name>DMA_APBPERI_SHA_PMS_CONSTRAIN_SRAM_WORLD_0_PMS_0</name>
              <description>dma_apbperi_sha_pms_constrain_sram_world_0_pms_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_SHA_PMS_CONSTRAIN_SRAM_WORLD_0_PMS_1</name>
              <description>dma_apbperi_sha_pms_constrain_sram_world_0_pms_1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_SHA_PMS_CONSTRAIN_SRAM_WORLD_0_PMS_2</name>
              <description>dma_apbperi_sha_pms_constrain_sram_world_0_pms_2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_SHA_PMS_CONSTRAIN_SRAM_WORLD_0_PMS_3</name>
              <description>dma_apbperi_sha_pms_constrain_sram_world_0_pms_3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_SHA_PMS_CONSTRAIN_SRAM_WORLD_1_PMS_0</name>
              <description>dma_apbperi_sha_pms_constrain_sram_world_1_pms_0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_SHA_PMS_CONSTRAIN_SRAM_WORLD_1_PMS_1</name>
              <description>dma_apbperi_sha_pms_constrain_sram_world_1_pms_1</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_SHA_PMS_CONSTRAIN_SRAM_WORLD_1_PMS_2</name>
              <description>dma_apbperi_sha_pms_constrain_sram_world_1_pms_2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_SHA_PMS_CONSTRAIN_SRAM_WORLD_1_PMS_3</name>
              <description>dma_apbperi_sha_pms_constrain_sram_world_1_pms_3</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_ADC_DAC_PMS_CONSTRAIN_0</name>
          <description>SENSITIVE_DMA_APBPERI_ADC_DAC_PMS_CONSTRAIN_0_REG</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_APBPERI_ADC_DAC_PMS_CONSTRAIN_LOCK</name>
              <description>dma_apbperi_adc_dac_pms_constrain_lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_ADC_DAC_PMS_CONSTRAIN_1</name>
          <description>SENSITIVE_DMA_APBPERI_ADC_DAC_PMS_CONSTRAIN_1_REG</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <resetValue>0x000FF0FF</resetValue>
          <fields>
            <field>
              <name>DMA_APBPERI_ADC_DAC_PMS_CONSTRAIN_SRAM_WORLD_0_PMS_0</name>
              <description>dma_apbperi_adc_dac_pms_constrain_sram_world_0_pms_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_ADC_DAC_PMS_CONSTRAIN_SRAM_WORLD_0_PMS_1</name>
              <description>dma_apbperi_adc_dac_pms_constrain_sram_world_0_pms_1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_ADC_DAC_PMS_CONSTRAIN_SRAM_WORLD_0_PMS_2</name>
              <description>dma_apbperi_adc_dac_pms_constrain_sram_world_0_pms_2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_ADC_DAC_PMS_CONSTRAIN_SRAM_WORLD_0_PMS_3</name>
              <description>dma_apbperi_adc_dac_pms_constrain_sram_world_0_pms_3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_ADC_DAC_PMS_CONSTRAIN_SRAM_WORLD_1_PMS_0</name>
              <description>dma_apbperi_adc_dac_pms_constrain_sram_world_1_pms_0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_ADC_DAC_PMS_CONSTRAIN_SRAM_WORLD_1_PMS_1</name>
              <description>dma_apbperi_adc_dac_pms_constrain_sram_world_1_pms_1</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_ADC_DAC_PMS_CONSTRAIN_SRAM_WORLD_1_PMS_2</name>
              <description>dma_apbperi_adc_dac_pms_constrain_sram_world_1_pms_2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_ADC_DAC_PMS_CONSTRAIN_SRAM_WORLD_1_PMS_3</name>
              <description>dma_apbperi_adc_dac_pms_constrain_sram_world_1_pms_3</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_PMS_MONITOR_0</name>
          <description>SENSITIVE_DMA_APBPERI_PMS_MONITOR_0_REG</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_APBPERI_PMS_MONITOR_LOCK</name>
              <description>dma_apbperi_pms_monitor_lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_PMS_MONITOR_1</name>
          <description>SENSITIVE_DMA_APBPERI_PMS_MONITOR_1_REG</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>DMA_APBPERI_PMS_MONITOR_VIOLATE_CLR</name>
              <description>dma_apbperi_pms_monitor_violate_clr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_PMS_MONITOR_VIOLATE_EN</name>
              <description>dma_apbperi_pms_monitor_violate_en</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_PMS_MONITOR_2</name>
          <description>SENSITIVE_DMA_APBPERI_PMS_MONITOR_2_REG</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_APBPERI_PMS_MONITOR_VIOLATE_INTR</name>
              <description>dma_apbperi_pms_monitor_violate_intr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_APBPERI_PMS_MONITOR_VIOLATE_STATUS_WORLD</name>
              <description>dma_apbperi_pms_monitor_violate_status_world</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_APBPERI_PMS_MONITOR_VIOLATE_STATUS_ADDR</name>
              <description>dma_apbperi_pms_monitor_violate_status_addr</description>
              <bitOffset>3</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_PMS_MONITOR_3</name>
          <description>SENSITIVE_DMA_APBPERI_PMS_MONITOR_3_REG</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_APBPERI_PMS_MONITOR_VIOLATE_STATUS_WR</name>
              <description>dma_apbperi_pms_monitor_violate_status_wr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_APBPERI_PMS_MONITOR_VIOLATE_STATUS_BYTEEN</name>
              <description>dma_apbperi_pms_monitor_violate_status_byteen</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_X_IRAM0_DRAM0_DMA_SPLIT_LINE_CONSTRAIN_0</name>
          <description>SENSITIVE_CORE_X_IRAM0_DRAM0_DMA_SPLIT_LINE_CONSTRAIN_0_REG</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_X_IRAM0_DRAM0_DMA_SPLIT_LINE_CONSTRAIN_LOCK</name>
              <description>core_x_iram0_dram0_dma_split_line_constrain_lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_X_IRAM0_DRAM0_DMA_SPLIT_LINE_CONSTRAIN_1</name>
          <description>SENSITIVE_CORE_X_IRAM0_DRAM0_DMA_SPLIT_LINE_CONSTRAIN_1_REG</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_X_IRAM0_DRAM0_DMA_SRAM_CATEGORY_0</name>
              <description>core_x_iram0_dram0_dma_sram_category_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_DRAM0_DMA_SRAM_CATEGORY_1</name>
              <description>core_x_iram0_dram0_dma_sram_category_1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_DRAM0_DMA_SRAM_CATEGORY_2</name>
              <description>core_x_iram0_dram0_dma_sram_category_2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_DRAM0_DMA_SRAM_SPLITADDR</name>
              <description>core_x_iram0_dram0_dma_sram_splitaddr</description>
              <bitOffset>14</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
