ZigEmbeddedGroup/microzig/port/espressif/esp/src/chips/ESP32-C3.svd
        <register>
          <name>CORE_0_PIF_PMS_MONITOR_4</name>
          <description>SENSITIVE_CORE_0_PIF_PMS_MONITOR_4_REG</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>CORE_0_PIF_PMS_MONITOR_NONWORD_VIOLATE_CLR</name>
              <description>core_0_pif_pms_monitor_nonword_violate_clr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_MONITOR_NONWORD_VIOLATE_EN</name>
              <description>core_0_pif_pms_monitor_nonword_violate_en</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_PIF_PMS_MONITOR_5</name>
          <description>SENSITIVE_CORE_0_PIF_PMS_MONITOR_5_REG</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_PIF_PMS_MONITOR_NONWORD_VIOLATE_INTR</name>
              <description>core_0_pif_pms_monitor_nonword_violate_intr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_MONITOR_NONWORD_VIOLATE_STATUS_HSIZE</name>
              <description>core_0_pif_pms_monitor_nonword_violate_status_hsize</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_MONITOR_NONWORD_VIOLATE_STATUS_HWORLD</name>
              <description>core_0_pif_pms_monitor_nonword_violate_status_hworld</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_PIF_PMS_MONITOR_6</name>
          <description>SENSITIVE_CORE_0_PIF_PMS_MONITOR_6_REG</description>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_PIF_PMS_MONITOR_NONWORD_VIOLATE_STATUS_HADDR</name>
              <description>core_0_pif_pms_monitor_nonword_violate_status_haddr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BACKUP_BUS_PMS_CONSTRAIN_0</name>
          <description>SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_0_REG</description>
          <addressOffset>0x14C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_LOCK</name>
              <description>backup_bus_pms_constrain_lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BACKUP_BUS_PMS_CONSTRAIN_1</name>
          <description>SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_1_REG</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <resetValue>0xCF0FFFFF</resetValue>
          <fields>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_UART</name>
              <description>backup_bus_pms_constrain_uart</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_G0SPI_1</name>
              <description>backup_bus_pms_constrain_g0spi_1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_G0SPI_0</name>
              <description>backup_bus_pms_constrain_g0spi_0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_GPIO</name>
              <description>backup_bus_pms_constrain_gpio</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_FE2</name>
              <description>backup_bus_pms_constrain_fe2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_FE</name>
              <description>backup_bus_pms_constrain_fe</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_TIMER</name>
              <description>backup_bus_pms_constrain_timer</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_RTC</name>
              <description>backup_bus_pms_constrain_rtc</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_IO_MUX</name>
              <description>backup_bus_pms_constrain_io_mux</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_WDG</name>
              <description>backup_bus_pms_constrain_wdg</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_MISC</name>
              <description>backup_bus_pms_constrain_misc</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_I2C</name>
              <description>backup_bus_pms_constrain_i2c</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_UART1</name>
              <description>backup_bus_pms_constrain_uart1</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BACKUP_BUS_PMS_CONSTRAIN_2</name>
          <description>SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_2_REG</description>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
          <resetValue>0xFCC30CF3</resetValue>
          <fields>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_BT</name>
              <description>backup_bus_pms_constrain_bt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_I2C_EXT0</name>
              <description>backup_bus_pms_constrain_i2c_ext0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_UHCI0</name>
              <description>backup_bus_pms_constrain_uhci0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_RMT</name>
              <description>backup_bus_pms_constrain_rmt</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_LEDC</name>
              <description>backup_bus_pms_constrain_ledc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_BB</name>
              <description>backup_bus_pms_constrain_bb</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_TIMERGROUP</name>
              <description>backup_bus_pms_constrain_timergroup</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_TIMERGROUP1</name>
              <description>backup_bus_pms_constrain_timergroup1</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_SYSTIMER</name>
              <description>backup_bus_pms_constrain_systimer</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BACKUP_BUS_PMS_CONSTRAIN_3</name>
          <description>SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_3_REG</description>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
          <resetValue>0x3CC0CC33</resetValue>
          <fields>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_SPI_2</name>
              <description>backup_bus_pms_constrain_spi_2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_APB_CTRL</name>
              <description>backup_bus_pms_constrain_apb_ctrl</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_CAN</name>
              <description>backup_bus_pms_constrain_can</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_I2S1</name>
              <description>backup_bus_pms_constrain_i2s1</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_RWBT</name>
              <description>backup_bus_pms_constrain_rwbt</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_WIFIMAC</name>
              <description>backup_bus_pms_constrain_wifimac</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_PWR</name>
              <description>backup_bus_pms_constrain_pwr</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BACKUP_BUS_PMS_CONSTRAIN_4</name>
          <description>SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_4_REG</description>
          <addressOffset>0x15C</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000F3FC</resetValue>
          <fields>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_USB_WRAP</name>
              <description>backup_bus_pms_constrain_usb_wrap</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_CRYPTO_PERI</name>
              <description>backup_bus_pms_constrain_crypto_peri</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_CRYPTO_DMA</name>
              <description>backup_bus_pms_constrain_crypto_dma</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_APB_ADC</name>
              <description>backup_bus_pms_constrain_apb_adc</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_BT_PWR</name>
              <description>backup_bus_pms_constrain_bt_pwr</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_CONSTRAIN_USB_DEVICE</name>
              <description>backup_bus_pms_constrain_usb_device</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BACKUP_BUS_PMS_MONITOR_0</name>
          <description>SENSITIVE_BACKUP_BUS_PMS_MONITOR_0_REG</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BACKUP_BUS_PMS_MONITOR_LOCK</name>
              <description>backup_bus_pms_monitor_lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BACKUP_BUS_PMS_MONITOR_1</name>
          <description>SENSITIVE_BACKUP_BUS_PMS_MONITOR_1_REG</description>
          <addressOffset>0x164</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>BACKUP_BUS_PMS_MONITOR_VIOLATE_CLR</name>
              <description>backup_bus_pms_monitor_violate_clr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_MONITOR_VIOLATE_EN</name>
              <description>backup_bus_pms_monitor_violate_en</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BACKUP_BUS_PMS_MONITOR_2</name>
          <description>SENSITIVE_BACKUP_BUS_PMS_MONITOR_2_REG</description>
          <addressOffset>0x168</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BACKUP_BUS_PMS_MONITOR_VIOLATE_INTR</name>
              <description>backup_bus_pms_monitor_violate_intr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_MONITOR_VIOLATE_STATUS_HTRANS</name>
              <description>backup_bus_pms_monitor_violate_status_htrans</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_MONITOR_VIOLATE_STATUS_HSIZE</name>
              <description>backup_bus_pms_monitor_violate_status_hsize</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BACKUP_BUS_PMS_MONITOR_VIOLATE_STATUS_HWRITE</name>
              <description>backup_bus_pms_monitor_violate_status_hwrite</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BACKUP_BUS_PMS_MONITOR_3</name>
          <description>SENSITIVE_BACKUP_BUS_PMS_MONITOR_3_REG</description>
          <addressOffset>0x16C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BACKUP_BUS_PMS_MONITOR_VIOLATE_HADDR</name>
              <description>backup_bus_pms_monitor_violate_haddr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>SENSITIVE_CLOCK_GATE_REG</description>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>clk_en</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>SENSITIVE_DATE_REG</description>
          <addressOffset>0xFFC</addressOffset>
          <size>0x20</size>
          <resetValue>0x02010200</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>reg_date</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
